<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-EVSTQN3/azprG1Anm3QDgpJLIm9Nao0Yz1ztcQTwFspd3yD65VohhpuuCOmLASjC" crossorigin="anonymous">
    <title>НУУЦЛАЛЫН БОДЛОГО</title>
    <style>
        body {
            line-height: 2;
        }
    </style>
  </head>
  <body>
    <div class="container">
      <h1>НУУЦЛАЛЫН БОДЛОГО</h1>
      <div><strong> 🎯 1. Аппын зорилго </strong><br> Teachervisit нь багш нар сурагчдын судалгаа бөглөх зориулалттай, боловсролын байгууллагад дотоод хэрэглээнд ашиглагддаг апп юм. </div>
      <div><strong> 📥 2. Хувийн мэдээлэл </strong><br> Апп хэрэглэгчдээс шинээр хувийн мэдээлэл цуглуулахгүй. Нэвтрэх нэр, нууц үгийг боловсролын байгууллагаас урьдчилан олгодог.
      Апп-д бүртгэл үүсгэх боломж байхгүй. Харин дараах мэдээлэл дамжиж болно: 
      <ul>
          <li>Нэвтрэх нэр, нууц үг (амжилттай нэвтрэхэд шаардлагатай)</li>
          <li>Push notification-д зориулсан token </div></li>
      </ul>
      <div><strong> 📲 3. Ашигладаг зөвшөөрлүүд </strong><br> Push мэдэгдэл: Сануулга, хуваарьт холбоотой мэдээлэл хүргэхэд ашиглана. </div>
      <div><strong> 🧩 4. Гуравдагч үйлчилгээ ашиглалт </strong><br> Firebase Cloud Messaging (FCM): 
        <ul>
          <li>Push мэдэгдэл хүргэх зорилгоор ашиглаж болно.</li>
          <li>Эдгээр үйлчилгээнүүд төхөөрөмжийн ID, push token зэргийг ашиглаж болно.</li>
        <ul>
      </div>
      <div><strong> 🔐 5. Мэдээллийн аюулгүй байдал </strong><br> 
          <ul>
              <li>Апп ба сервер хооронд дамжих мэдээлэл нь SSL шифрлэлттэй. </li>
              <li>Сервер API хамгаалалттай, байгууллагын бодлогын дагуу ажиллана. </li>
              <li>Хэрэглэгчийн мэдээлэл нь найдвартай хамгаалагдсан.</li>
          <ul>
      </div>
      <div><strong> 🧑‍💼 6. Мэдээлэл засах / устгах </strong><br> Хэрэглэгч өөрийн мэдээллийг апп дээрээс шууд засах боломжгүй. Мэдээллээ засуулах, эсвэл устгуулах бол дараах хаягаар хандана уу: <br>
      <strong> Өмнөговь аймгийн Цогтцэций сум </strong> 📧 Цахим шуудан: uvurkhangai@mecs.gov.mn </div>
      <div><strong> 👶 7. Хүүхдийн мэдээлэл </strong><br> Апп нь 13-аас доош насны хүүхдэд зориулагдаагүй. Нэвтрэх эрх зөвхөн байгууллагаар дамжин олгогддог. </div>
    </div>
  </body>
</html>